// -----// IR Dump Before mlir::iree_compiler::IREE::HAL::AssignTargetDevicesPass (iree-hal-assign-target-devices) //----- //
module attributes {tf.versions = {bad_consumers = [], min_consumer = 0 : i32, producer = 27 : i32}} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
    %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
    return %0 : tensor<10xi32>
  }
}


// -----// IR Dump Before AutoInputConversionPipeline (iree-auto-input-conversion) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu], tf.versions = {bad_consumers = [], min_consumer = 0 : i32, producer = 27 : i32}} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
    %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
    return %0 : tensor<10xi32>
  }
}


// -----// IR Dump Before Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  return %0 : tensor<10xi32>
}

// -----// IR Dump Before StableHLOCanonicalize (iree-stablehlo-canonicalize) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  return %0 : tensor<10xi32>
}

// -----// IR Dump Before CSE (cse) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  return %0 : tensor<10xi32>
}

// -----// IR Dump Before LegalizeControlFlow (iree-stablehlo-legalize-control-flow) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  return %0 : tensor<10xi32>
}

// -----// IR Dump Before FlattenTuplesInSCF (iree-stablehlo-preprocessing-flatten-scf-tuples) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu], tf.versions = {bad_consumers = [], min_consumer = 0 : i32, producer = 27 : i32}} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
    %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
    return %0 : tensor<10xi32>
  }
}


// -----// IR Dump Before StableHLOToStableHLOPreprocessing (iree-stablehlo-to-stablehlo-preprocessing) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu], tf.versions = {bad_consumers = [], min_consumer = 0 : i32, producer = 27 : i32}} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
    %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
    return %0 : tensor<10xi32>
  }
}


// -----// IR Dump Before StableHLOCanonicalize (iree-stablehlo-canonicalize) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  return %0 : tensor<10xi32>
}

// -----// IR Dump Before ShapeToShapeLowering (shape-to-shape-lowering) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  return %0 : tensor<10xi32>
}

// -----// IR Dump Before ConvertShapeToStandard (convert-shape-to-std) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu], tf.versions = {bad_consumers = [], min_consumer = 0 : i32, producer = 27 : i32}} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
    %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
    return %0 : tensor<10xi32>
  }
}


// -----// IR Dump Before Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  return %0 : tensor<10xi32>
}

// -----// IR Dump Before StableHLOCanonicalize (iree-stablehlo-canonicalize) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  return %0 : tensor<10xi32>
}

// -----// IR Dump Before Inliner (inline) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu], tf.versions = {bad_consumers = [], min_consumer = 0 : i32, producer = 27 : i32}} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
    %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
    return %0 : tensor<10xi32>
  }
}


// -----// IR Dump Before Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  return %0 : tensor<10xi32>
}

// -----// IR Dump Before DemoteI64ToI32 (iree-util-demote-i64-to-i32) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu], tf.versions = {bad_consumers = [], min_consumer = 0 : i32, producer = 27 : i32}} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
    %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
    return %0 : tensor<10xi32>
  }
}


// -----// IR Dump Before DemoteF64ToF32 (iree-util-demote-f64-to-f32) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu], tf.versions = {bad_consumers = [], min_consumer = 0 : i32, producer = 27 : i32}} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
    %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
    return %0 : tensor<10xi32>
  }
}


// -----// IR Dump Before Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  return %0 : tensor<10xi32>
}

// -----// IR Dump Before StableHLOCanonicalize (iree-stablehlo-canonicalize) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  return %0 : tensor<10xi32>
}

// -----// IR Dump Before CSE (cse) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  return %0 : tensor<10xi32>
}

// -----// IR Dump Before LegalizeShapeComputations (iree-stablehlo-legalize-shape-computations) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  return %0 : tensor<10xi32>
}

// -----// IR Dump Before ConvertStableHloToLinalgExt (iree-stablehlo-to-linalg-ext) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  return %0 : tensor<10xi32>
}

// -----// IR Dump Before LegalizeChlo (iree-stablehlo-legalize-chlo) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  return %0 : tensor<10xi32>
}

// -----// IR Dump Before ConvertStableHloToIreeInputDialects (iree-stablehlo-to-iree-input) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu], tf.versions = {bad_consumers = [], min_consumer = 0 : i32, producer = 27 : i32}} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Add"}} {
    %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
    return %0 : tensor<10xi32>
  }
}


// -----// IR Dump Before ReconcileUnrealizedCasts (reconcile-unrealized-casts) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
    %0 = tensor.empty() : tensor<10xi32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %2 = arith.addi %in, %in_0 : i32
      linalg.yield %2 : i32
    } -> tensor<10xi32>
    return %1 : tensor<10xi32>
  }
}


// -----// IR Dump Before Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
  %0 = tensor.empty() : tensor<10xi32>
  %1 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %2 = arith.addi %in, %in_0 : i32
    linalg.yield %2 : i32
  } -> tensor<10xi32>
  return %1 : tensor<10xi32>
}

// -----// IR Dump Before StableHLOCanonicalize (iree-stablehlo-canonicalize) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
  %0 = tensor.empty() : tensor<10xi32>
  %1 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %2 = arith.addi %in, %in_0 : i32
    linalg.yield %2 : i32
  } -> tensor<10xi32>
  return %1 : tensor<10xi32>
}

// -----// IR Dump Before VerifyCompilerStableHloInputLegality (iree-stablehlo-verify-compiler-input-legality) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
    %0 = tensor.empty() : tensor<10xi32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %2 = arith.addi %in, %in_0 : i32
      linalg.yield %2 : i32
    } -> tensor<10xi32>
    return %1 : tensor<10xi32>
  }
}


// -----// IR Dump Before IREEImportPublic (iree-import-public) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
    %0 = tensor.empty() : tensor<10xi32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %2 = arith.addi %in, %in_0 : i32
      linalg.yield %2 : i32
    } -> tensor<10xi32>
    return %1 : tensor<10xi32>
  }
}


// -----// IR Dump Before ImportMLProgram (iree-import-ml-program) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
    %0 = tensor.empty() : tensor<10xi32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %2 = arith.addi %in, %in_0 : i32
      linalg.yield %2 : i32
    } -> tensor<10xi32>
    return %1 : tensor<10xi32>
  }
}


// -----// IR Dump Before SanitizeModuleNames (iree-sanitize-module-names) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
    %0 = tensor.empty() : tensor<10xi32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %2 = arith.addi %in, %in_0 : i32
      linalg.yield %2 : i32
    } -> tensor<10xi32>
    return %1 : tensor<10xi32>
  }
}


// -----// IR Dump Before mlir::iree_compiler::IREE::ABI::ConvertStreamableOpsPass (iree-abi-convert-streamable-ops) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
    %0 = tensor.empty() : tensor<10xi32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %2 = arith.addi %in, %in_0 : i32
      linalg.yield %2 : i32
    } -> tensor<10xi32>
    return %1 : tensor<10xi32>
  }
}


// -----// IR Dump Before mlir::iree_compiler::IREE::ABI::WrapEntryPointsPass (iree-abi-wrap-entry-points) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
    %0 = tensor.empty() : tensor<10xi32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %2 = arith.addi %in, %in_0 : i32
      linalg.yield %2 : i32
    } -> tensor<10xi32>
    return %1 : tensor<10xi32>
  }
}


// -----// IR Dump Before Inliner (inline) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
    %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
    %2 = call @_main(%0, %1) : (tensor<10xi32>, tensor<10xi32>) -> tensor<10xi32>
    %3 = hal.tensor.export %2 "output 0" : tensor<10xi32> -> !hal.buffer_view
    return %3 : !hal.buffer_view
  }
  func.func private @_main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
    %0 = tensor.empty() : tensor<10xi32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %2 = arith.addi %in, %in_0 : i32
      linalg.yield %2 : i32
    } -> tensor<10xi32>
    return %1 : tensor<10xi32>
  }
}


// -----// IR Dump Before Canonicalizer (canonicalize) //----- //
func.func private @_main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
  %0 = tensor.empty() : tensor<10xi32>
  %1 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %2 = arith.addi %in, %in_0 : i32
    linalg.yield %2 : i32
  } -> tensor<10xi32>
  return %1 : tensor<10xi32>
}

// -----// IR Dump Before Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = call @_main(%0, %1) : (tensor<10xi32>, tensor<10xi32>) -> tensor<10xi32>
  %3 = hal.tensor.export %2 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %3 : !hal.buffer_view
}

// -----// IR Dump Before Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %5 = arith.addi %in, %in_0 : i32
    linalg.yield %5 : i32
  } -> tensor<10xi32>
  %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump Before Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %5 = arith.addi %in, %in_0 : i32
    linalg.yield %5 : i32
  } -> tensor<10xi32>
  %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump Before CSE (cse) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %5 = arith.addi %in, %in_0 : i32
    linalg.yield %5 : i32
  } -> tensor<10xi32>
  %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump Before SymbolDCE (symbol-dce) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
    %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %5 = arith.addi %in, %in_0 : i32
      linalg.yield %5 : i32
    } -> tensor<10xi32>
    %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
}


// -----// IR Dump Before DemoteF64ToF32 (iree-util-demote-f64-to-f32) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
    %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %5 = arith.addi %in, %in_0 : i32
      linalg.yield %5 : i32
    } -> tensor<10xi32>
    %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
}


// -----// IR Dump Before RemoveZeroExtentTensors (iree-flow-remove-zero-extent-tensors) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %5 = arith.addi %in, %in_0 : i32
    linalg.yield %5 : i32
  } -> tensor<10xi32>
  %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump Before DetachElementwiseFromNamedOps (iree-flow-detach-elementwise-from-named-ops) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %5 = arith.addi %in, %in_0 : i32
    linalg.yield %5 : i32
  } -> tensor<10xi32>
  %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump Before LinalgNamedOpConversion (linalg-named-op-conversion) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %5 = arith.addi %in, %in_0 : i32
    linalg.yield %5 : i32
  } -> tensor<10xi32>
  %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump Before Convert1X1FilterConv2DToMatmul (iree-flow-convert-1x1-filter-conv2d-to-matmul) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %5 = arith.addi %in, %in_0 : i32
    linalg.yield %5 : i32
  } -> tensor<10xi32>
  %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump Before EraseUnusedLinalgOperands (iree-flow-erase-unused-linalg-operands) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
    %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %5 = arith.addi %in, %in_0 : i32
      linalg.yield %5 : i32
    } -> tensor<10xi32>
    %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
}


// -----// IR Dump Before ExpandTensorShapes (iree-flow-expand-tensor-shapes) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
    %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %5 = arith.addi %in, %in_0 : i32
      linalg.yield %5 : i32
    } -> tensor<10xi32>
    %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
}


// -----// IR Dump Before ConvertElementwiseToLinalg (convert-elementwise-to-linalg) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %5 = arith.addi %in, %in_0 : i32
    linalg.yield %5 : i32
  } -> tensor<10xi32>
  %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump Before GeneralizeLinalgNamedOps (iree-flow-generalize-linalg-named-ops) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %5 = arith.addi %in, %in_0 : i32
    linalg.yield %5 : i32
  } -> tensor<10xi32>
  %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump Before FoldUnitExtentDims (iree-flow-fold-unit-extent-dims) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %5 = arith.addi %in, %in_0 : i32
    linalg.yield %5 : i32
  } -> tensor<10xi32>
  %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump Before FuseDequantizationMatmul (iree-flow-fuse-dequantization-matmul) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %5 = arith.addi %in, %in_0 : i32
    linalg.yield %5 : i32
  } -> tensor<10xi32>
  %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump Before Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %5 = arith.addi %in, %in_0 : i32
    linalg.yield %5 : i32
  } -> tensor<10xi32>
  %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump Before CSE (cse) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %5 = arith.addi %in, %in_0 : i32
    linalg.yield %5 : i32
  } -> tensor<10xi32>
  %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump Before MaterializeHomogeneousEncodings (iree-global-opt-materialize-homogeneous-encodings) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
    %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %5 = arith.addi %in, %in_0 : i32
      linalg.yield %5 : i32
    } -> tensor<10xi32>
    %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
}


// -----// IR Dump Before CPUMaterializeUpperBoundTileSize (iree-cpu-materialize-upper-bound-tile-size) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %5 = arith.addi %in, %in_0 : i32
    linalg.yield %5 : i32
  } -> tensor<10xi32>
  %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump Before CPUMaterializeEncoding (iree-cpu-materialize-encoding) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %5 = arith.addi %in, %in_0 : i32
    linalg.yield %5 : i32
  } -> tensor<10xi32>
  %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump Before FixedPointIterator (iree-util-fixed-point-iterator) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
    %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %5 = arith.addi %in, %in_0 : i32
      linalg.yield %5 : i32
    } -> tensor<10xi32>
    %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
}


// -----// IR Dump Before SimplifyGlobalAccesses (iree-util-simplify-global-accesses) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %5 = arith.addi %in, %in_0 : i32
    linalg.yield %5 : i32
  } -> tensor<10xi32>
  %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump Before ApplyPatterns (iree-util-apply-patterns) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu], iree.fixedpoint.iteration = 0 : index} {
  func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
    %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %5 = arith.addi %in, %in_0 : i32
      linalg.yield %5 : i32
    } -> tensor<10xi32>
    %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
}


// -----// IR Dump Before FoldGlobals (iree-util-fold-globals) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu], iree.fixedpoint.iteration = 0 : index} {
  func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
    %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %5 = arith.addi %in, %in_0 : i32
      linalg.yield %5 : i32
    } -> tensor<10xi32>
    %4 = hal.tensor.export %3 "output 0" : tensor<10xi32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
}


// -----// IR Dump Before IPO (iree-util-ipo) //----- //
