// -----// IR Dump After mlir::iree_compiler::IREE::HAL::AssignTargetDevicesPass (iree-hal-assign-target-devices) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu], tf.versions = {bad_consumers = [], min_consumer = 0 : i32, producer = 27 : i32}} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
    %0 = stablehlo.multiply %arg0, %arg1 : tensor<10xi32>
    %1 = stablehlo.add %0, %arg1 : tensor<10xi32>
    return %1 : tensor<10xi32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
  %0 = stablehlo.multiply %arg0, %arg1 : tensor<10xi32>
  %1 = stablehlo.add %0, %arg1 : tensor<10xi32>
  return %1 : tensor<10xi32>
}

// -----// IR Dump After StableHLOCanonicalize (iree-stablehlo-canonicalize) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
  %0 = stablehlo.multiply %arg0, %arg1 : tensor<10xi32>
  %1 = stablehlo.add %0, %arg1 : tensor<10xi32>
  return %1 : tensor<10xi32>
}

// -----// IR Dump After CSE (cse) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
  %0 = stablehlo.multiply %arg0, %arg1 : tensor<10xi32>
  %1 = stablehlo.add %0, %arg1 : tensor<10xi32>
  return %1 : tensor<10xi32>
}

// -----// IR Dump After LegalizeControlFlow (iree-stablehlo-legalize-control-flow) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
  %0 = stablehlo.multiply %arg0, %arg1 : tensor<10xi32>
  %1 = stablehlo.add %0, %arg1 : tensor<10xi32>
  return %1 : tensor<10xi32>
}

// -----// IR Dump After LegalizeControlFlow2 (iree-stablehlo-legalize-control-flow2) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  %1 = stablehlo.multiply %0, %arg1 : tensor<10xi32>
  return %1 : tensor<10xi32>
}

// -----// IR Dump After FlattenTuplesInSCF (iree-stablehlo-preprocessing-flatten-scf-tuples) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu], tf.versions = {bad_consumers = [], min_consumer = 0 : i32, producer = 27 : i32}} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
    %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
    %1 = stablehlo.multiply %0, %arg1 : tensor<10xi32>
    return %1 : tensor<10xi32>
  }
}


// -----// IR Dump After StableHLOToStableHLOPreprocessing (iree-stablehlo-to-stablehlo-preprocessing) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu], tf.versions = {bad_consumers = [], min_consumer = 0 : i32, producer = 27 : i32}} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
    %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
    %1 = stablehlo.multiply %0, %arg1 : tensor<10xi32>
    return %1 : tensor<10xi32>
  }
}


// -----// IR Dump After StableHLOCanonicalize (iree-stablehlo-canonicalize) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  %1 = stablehlo.multiply %0, %arg1 : tensor<10xi32>
  return %1 : tensor<10xi32>
}

// -----// IR Dump After ShapeToShapeLowering (shape-to-shape-lowering) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  %1 = stablehlo.multiply %0, %arg1 : tensor<10xi32>
  return %1 : tensor<10xi32>
}

// -----// IR Dump After ConvertShapeToStandard (convert-shape-to-std) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu], tf.versions = {bad_consumers = [], min_consumer = 0 : i32, producer = 27 : i32}} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
    %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
    %1 = stablehlo.multiply %0, %arg1 : tensor<10xi32>
    return %1 : tensor<10xi32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  %1 = stablehlo.multiply %0, %arg1 : tensor<10xi32>
  return %1 : tensor<10xi32>
}

// -----// IR Dump After StableHLOCanonicalize (iree-stablehlo-canonicalize) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  %1 = stablehlo.multiply %0, %arg1 : tensor<10xi32>
  return %1 : tensor<10xi32>
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  %1 = stablehlo.multiply %0, %arg1 : tensor<10xi32>
  return %1 : tensor<10xi32>
}

// -----// IR Dump After Inliner (inline) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu], tf.versions = {bad_consumers = [], min_consumer = 0 : i32, producer = 27 : i32}} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
    %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
    %1 = stablehlo.multiply %0, %arg1 : tensor<10xi32>
    return %1 : tensor<10xi32>
  }
}


// -----// IR Dump After DemoteI64ToI32 (iree-util-demote-i64-to-i32) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu], tf.versions = {bad_consumers = [], min_consumer = 0 : i32, producer = 27 : i32}} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
    %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
    %1 = stablehlo.multiply %0, %arg1 : tensor<10xi32>
    return %1 : tensor<10xi32>
  }
}


// -----// IR Dump After DemoteF64ToF32 (iree-util-demote-f64-to-f32) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu], tf.versions = {bad_consumers = [], min_consumer = 0 : i32, producer = 27 : i32}} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
    %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
    %1 = stablehlo.multiply %0, %arg1 : tensor<10xi32>
    return %1 : tensor<10xi32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  %1 = stablehlo.multiply %0, %arg1 : tensor<10xi32>
  return %1 : tensor<10xi32>
}

// -----// IR Dump After StableHLOCanonicalize (iree-stablehlo-canonicalize) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  %1 = stablehlo.multiply %0, %arg1 : tensor<10xi32>
  return %1 : tensor<10xi32>
}

// -----// IR Dump After CSE (cse) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  %1 = stablehlo.multiply %0, %arg1 : tensor<10xi32>
  return %1 : tensor<10xi32>
}

// -----// IR Dump After LegalizeShapeComputations (iree-stablehlo-legalize-shape-computations) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  %1 = stablehlo.multiply %0, %arg1 : tensor<10xi32>
  return %1 : tensor<10xi32>
}

// -----// IR Dump After ConvertStableHloToLinalgExt (iree-stablehlo-to-linalg-ext) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  %1 = stablehlo.multiply %0, %arg1 : tensor<10xi32>
  return %1 : tensor<10xi32>
}

// -----// IR Dump After LegalizeChlo (iree-stablehlo-legalize-chlo) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> attributes {tf.entry_function = {control_outputs = "", inputs = "input0,input1", outputs = "Mul"}} {
  %0 = stablehlo.add %arg0, %arg1 : tensor<10xi32>
  %1 = stablehlo.multiply %0, %arg1 : tensor<10xi32>
  return %1 : tensor<10xi32>
}

// -----// IR Dump After ConvertStableHloToIreeInputDialects (iree-stablehlo-to-iree-input) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
    %0 = tensor.empty() : tensor<10xi32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %4 = arith.addi %in, %in_0 : i32
      linalg.yield %4 : i32
    } -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%1, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %4 = arith.muli %in, %in_0 : i32
      linalg.yield %4 : i32
    } -> tensor<10xi32>
    return %3 : tensor<10xi32>
  }
}


// -----// IR Dump After ReconcileUnrealizedCasts (reconcile-unrealized-casts) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
    %0 = tensor.empty() : tensor<10xi32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %4 = arith.addi %in, %in_0 : i32
      linalg.yield %4 : i32
    } -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%1, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %4 = arith.muli %in, %in_0 : i32
      linalg.yield %4 : i32
    } -> tensor<10xi32>
    return %3 : tensor<10xi32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
  %0 = tensor.empty() : tensor<10xi32>
  %1 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %4 = arith.addi %in, %in_0 : i32
    linalg.yield %4 : i32
  } -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%1, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %4 = arith.muli %in, %in_0 : i32
    linalg.yield %4 : i32
  } -> tensor<10xi32>
  return %3 : tensor<10xi32>
}

// -----// IR Dump After StableHLOCanonicalize (iree-stablehlo-canonicalize) //----- //
func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
  %0 = tensor.empty() : tensor<10xi32>
  %1 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %4 = arith.addi %in, %in_0 : i32
    linalg.yield %4 : i32
  } -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%1, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %4 = arith.muli %in, %in_0 : i32
    linalg.yield %4 : i32
  } -> tensor<10xi32>
  return %3 : tensor<10xi32>
}

// -----// IR Dump After VerifyCompilerStableHloInputLegality (iree-stablehlo-verify-compiler-input-legality) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
    %0 = tensor.empty() : tensor<10xi32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %4 = arith.addi %in, %in_0 : i32
      linalg.yield %4 : i32
    } -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%1, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %4 = arith.muli %in, %in_0 : i32
      linalg.yield %4 : i32
    } -> tensor<10xi32>
    return %3 : tensor<10xi32>
  }
}


// -----// IR Dump After AutoInputConversionPipeline (iree-auto-input-conversion) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
    %0 = tensor.empty() : tensor<10xi32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %4 = arith.addi %in, %in_0 : i32
      linalg.yield %4 : i32
    } -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%1, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %4 = arith.muli %in, %in_0 : i32
      linalg.yield %4 : i32
    } -> tensor<10xi32>
    return %3 : tensor<10xi32>
  }
}


// -----// IR Dump After IREEImportPublic (iree-import-public) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
    %0 = tensor.empty() : tensor<10xi32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %4 = arith.addi %in, %in_0 : i32
      linalg.yield %4 : i32
    } -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%1, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %4 = arith.muli %in, %in_0 : i32
      linalg.yield %4 : i32
    } -> tensor<10xi32>
    return %3 : tensor<10xi32>
  }
}


// -----// IR Dump After ImportMLProgram (iree-import-ml-program) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
    %0 = tensor.empty() : tensor<10xi32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %4 = arith.addi %in, %in_0 : i32
      linalg.yield %4 : i32
    } -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%1, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %4 = arith.muli %in, %in_0 : i32
      linalg.yield %4 : i32
    } -> tensor<10xi32>
    return %3 : tensor<10xi32>
  }
}


// -----// IR Dump After SanitizeModuleNames (iree-sanitize-module-names) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
    %0 = tensor.empty() : tensor<10xi32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %4 = arith.addi %in, %in_0 : i32
      linalg.yield %4 : i32
    } -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%1, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %4 = arith.muli %in, %in_0 : i32
      linalg.yield %4 : i32
    } -> tensor<10xi32>
    return %3 : tensor<10xi32>
  }
}


// -----// IR Dump After mlir::iree_compiler::IREE::ABI::ConvertStreamableOpsPass (iree-abi-convert-streamable-ops) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
    %0 = tensor.empty() : tensor<10xi32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %4 = arith.addi %in, %in_0 : i32
      linalg.yield %4 : i32
    } -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%1, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %4 = arith.muli %in, %in_0 : i32
      linalg.yield %4 : i32
    } -> tensor<10xi32>
    return %3 : tensor<10xi32>
  }
}


// -----// IR Dump After mlir::iree_compiler::IREE::ABI::WrapEntryPointsPass (iree-abi-wrap-entry-points) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
    %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
    %2 = call @_main(%0, %1) : (tensor<10xi32>, tensor<10xi32>) -> tensor<10xi32>
    %3 = hal.tensor.export %2 "output 0" : tensor<10xi32> -> !hal.buffer_view
    return %3 : !hal.buffer_view
  }
  func.func private @_main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
    %0 = tensor.empty() : tensor<10xi32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %4 = arith.addi %in, %in_0 : i32
      linalg.yield %4 : i32
    } -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%1, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %4 = arith.muli %in, %in_0 : i32
      linalg.yield %4 : i32
    } -> tensor<10xi32>
    return %3 : tensor<10xi32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func private @_main(%arg0: tensor<10xi32>, %arg1: tensor<10xi32>) -> tensor<10xi32> {
  %0 = tensor.empty() : tensor<10xi32>
  %1 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%arg0, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%0 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %4 = arith.addi %in, %in_0 : i32
    linalg.yield %4 : i32
  } -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%1, %arg1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %4 = arith.muli %in, %in_0 : i32
    linalg.yield %4 : i32
  } -> tensor<10xi32>
  return %3 : tensor<10xi32>
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = call @_main(%0, %1) : (tensor<10xi32>, tensor<10xi32>) -> tensor<10xi32>
  %3 = hal.tensor.export %2 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %3 : !hal.buffer_view
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %7 = arith.addi %in, %in_0 : i32
    linalg.yield %7 : i32
  } -> tensor<10xi32>
  %4 = tensor.empty() : tensor<10xi32>
  %5 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%3, %1 : tensor<10xi32>, tensor<10xi32>) outs(%4 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %7 = arith.muli %in, %in_0 : i32
    linalg.yield %7 : i32
  } -> tensor<10xi32>
  %6 = hal.tensor.export %5 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %6 : !hal.buffer_view
}

// -----// IR Dump After Inliner (inline) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
    %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %7 = arith.addi %in, %in_0 : i32
      linalg.yield %7 : i32
    } -> tensor<10xi32>
    %4 = tensor.empty() : tensor<10xi32>
    %5 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%3, %1 : tensor<10xi32>, tensor<10xi32>) outs(%4 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %7 = arith.muli %in, %in_0 : i32
      linalg.yield %7 : i32
    } -> tensor<10xi32>
    %6 = hal.tensor.export %5 "output 0" : tensor<10xi32> -> !hal.buffer_view
    return %6 : !hal.buffer_view
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %7 = arith.addi %in, %in_0 : i32
    linalg.yield %7 : i32
  } -> tensor<10xi32>
  %4 = tensor.empty() : tensor<10xi32>
  %5 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%3, %1 : tensor<10xi32>, tensor<10xi32>) outs(%4 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %7 = arith.muli %in, %in_0 : i32
    linalg.yield %7 : i32
  } -> tensor<10xi32>
  %6 = hal.tensor.export %5 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %6 : !hal.buffer_view
}

// -----// IR Dump After CSE (cse) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %6 = arith.addi %in, %in_0 : i32
    linalg.yield %6 : i32
  } -> tensor<10xi32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%3, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %6 = arith.muli %in, %in_0 : i32
    linalg.yield %6 : i32
  } -> tensor<10xi32>
  %5 = hal.tensor.export %4 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %5 : !hal.buffer_view
}

// -----// IR Dump After SymbolDCE (symbol-dce) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
    %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %6 = arith.addi %in, %in_0 : i32
      linalg.yield %6 : i32
    } -> tensor<10xi32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%3, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %6 = arith.muli %in, %in_0 : i32
      linalg.yield %6 : i32
    } -> tensor<10xi32>
    %5 = hal.tensor.export %4 "output 0" : tensor<10xi32> -> !hal.buffer_view
    return %5 : !hal.buffer_view
  }
}


// -----// IR Dump After DemoteF64ToF32 (iree-util-demote-f64-to-f32) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
    %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %6 = arith.addi %in, %in_0 : i32
      linalg.yield %6 : i32
    } -> tensor<10xi32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%3, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %6 = arith.muli %in, %in_0 : i32
      linalg.yield %6 : i32
    } -> tensor<10xi32>
    %5 = hal.tensor.export %4 "output 0" : tensor<10xi32> -> !hal.buffer_view
    return %5 : !hal.buffer_view
  }
}


// -----// IR Dump After RemoveZeroExtentTensors (iree-global-opt-remove-zero-extent-tensors) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %6 = arith.addi %in, %in_0 : i32
    linalg.yield %6 : i32
  } -> tensor<10xi32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%3, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %6 = arith.muli %in, %in_0 : i32
    linalg.yield %6 : i32
  } -> tensor<10xi32>
  %5 = hal.tensor.export %4 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %5 : !hal.buffer_view
}

// -----// IR Dump After DetachElementwiseFromNamedOps (iree-global-opt-detach-elementwise-from-named-ops) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %6 = arith.addi %in, %in_0 : i32
    linalg.yield %6 : i32
  } -> tensor<10xi32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%3, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %6 = arith.muli %in, %in_0 : i32
    linalg.yield %6 : i32
  } -> tensor<10xi32>
  %5 = hal.tensor.export %4 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %5 : !hal.buffer_view
}

// -----// IR Dump After LinalgNamedOpConversion (linalg-named-op-conversion) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %6 = arith.addi %in, %in_0 : i32
    linalg.yield %6 : i32
  } -> tensor<10xi32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%3, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %6 = arith.muli %in, %in_0 : i32
    linalg.yield %6 : i32
  } -> tensor<10xi32>
  %5 = hal.tensor.export %4 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %5 : !hal.buffer_view
}

// -----// IR Dump After Convert1X1FilterConv2DToMatmul (iree-global-opt-convert-1x1-filter-conv2d-to-matmul) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %6 = arith.addi %in, %in_0 : i32
    linalg.yield %6 : i32
  } -> tensor<10xi32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%3, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %6 = arith.muli %in, %in_0 : i32
    linalg.yield %6 : i32
  } -> tensor<10xi32>
  %5 = hal.tensor.export %4 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %5 : !hal.buffer_view
}

// -----// IR Dump After EraseUnusedLinalgOperands (iree-global-opt-erase-unused-linalg-operands) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
    %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %6 = arith.addi %in, %in_0 : i32
      linalg.yield %6 : i32
    } -> tensor<10xi32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%3, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %6 = arith.muli %in, %in_0 : i32
      linalg.yield %6 : i32
    } -> tensor<10xi32>
    %5 = hal.tensor.export %4 "output 0" : tensor<10xi32> -> !hal.buffer_view
    return %5 : !hal.buffer_view
  }
}


// -----// IR Dump After ExpandTensorShapes (iree-flow-expand-tensor-shapes) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<(d0) -> (d0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
    %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
    %2 = tensor.empty() : tensor<10xi32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %6 = arith.addi %in, %in_0 : i32
      linalg.yield %6 : i32
    } -> tensor<10xi32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%3, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
    ^bb0(%in: i32, %in_0: i32, %out: i32):
      %6 = arith.muli %in, %in_0 : i32
      linalg.yield %6 : i32
    } -> tensor<10xi32>
    %5 = hal.tensor.export %4 "output 0" : tensor<10xi32> -> !hal.buffer_view
    return %5 : !hal.buffer_view
  }
}


// -----// IR Dump After ConvertElementwiseToLinalg (convert-elementwise-to-linalg) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %6 = arith.addi %in, %in_0 : i32
    linalg.yield %6 : i32
  } -> tensor<10xi32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%3, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %6 = arith.muli %in, %in_0 : i32
    linalg.yield %6 : i32
  } -> tensor<10xi32>
  %5 = hal.tensor.export %4 "output 0" : tensor<10xi32> -> !hal.buffer_view
  return %5 : !hal.buffer_view
}

// -----// IR Dump After GeneralizeLinalgNamedOps (iree-flow-generalize-linalg-named-ops) //----- //
func.func @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<10xi32>
  %1 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<10xi32>
  %2 = tensor.empty() : tensor<10xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%0, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %6 = arith.addi %in, %in_0 : i32
    linalg.yield %6 : i32
  } -> tensor<10xi32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%3, %1 : tensor<10xi32>, tensor<10xi32>) outs(%2 : tensor<10xi32>) {
  ^bb0(%in: i32, %in_0: i32, %out: i32):
    %6 = arith.muli %in, %in_0 : i32
    linalg.yield %6 : i32
  } -> tensor<10xi32>
